Ninagawa123/Meridian_Dev/PlatformIO/TypeK_ESP32_0614/main.cpp

// Meridian_TWIN_for_ESP32_20220716 By Izumi Ninagawa & Meridian Project
// MIT Licenced.
//
// Teensy4.0 - (SPI) - ESP32DevKitC - (Wifi/UDP) - PC/python
// ESP32用のマルチスレッド化したMeiridian_core
// Meridian Board Type.K に搭載するESP32に対応。
// PS4コントローラ再対応 https://qiita.com/Ninagawa_Izumi/items/d8966092fe2abd3cba79
// UDP送受とBT受信をスレッド化し、フラグによりデータの流れを円滑化
// ただしBTを同時接続するとエラーでデータが欠損するので、リモコンは一旦わすれる。
// リモコンの運用は今後、PC-UDP接続時はPC側でリモコン処理、
// PCレスのスタンドアロン時はESP32でBTを使い、Wiiをキャンセル（未導入）で対応する。
// IP固定化の要素を追加。

// Meridan Board -LITE-
// ESP32用スケッチ　20220716版
#define VERSION "Hello, This is Meridian_TWIN_for_ESP32_20220716." // バージョン表示

// 100Hz通信で安定動作。
// 現在使える構成要素は
// ① ICSサーボL,R 11個ずつ合計22軸分。
// ② リモコン KRC-5FH + KRR-5FH
// ③ 9軸センサ BNO005
// ④ SDカード(SPIに接続)

// ESP32 DevkitC + PlatformIOで使うことを想定
// PlatformIO上でのESP32のボードバージョンは3.5.0が良い。（4系はうまく動かないらしい）
// Serial1を使うには設定を変更する必要あり. 参考 → https://qiita.com/Ninagawa_Izumi/items/8ce2d55728fd5973087d

// サーボ値の返信は取りこぼしなどあるが、取りこぼす直線のデータを使うことで擬似的に安定させている。
// そのため返信値は参考値であり、基本的にはサーボ値を指示して動作させることが基本的な利用法となる。

//================================================================================================================
//---- E S P 3 2 の 配 線  ----------------------------------------------------------------------------------------
//================================================================================================================
/*
 ESP32devkitC  -  Teensy4.0
   3V3         -  xxxxxxxx

*/

//================================================================================================================
//---- 初 期 設 定  -----------------------------------------------------------------------------------------------
//================================================================================================================

/* ライブラリ導入 */
#include <Arduino.h>
#include <WiFi.h>    // WiFi通信用ライブラリ
#include <WiFiUdp.h> // UDP通信用ライブラリ
#include <Wire.h>    // I2C通信用ライブラリ
#include <SPI.h>     // SPI自体は使用しないがBNO055に必要

/* 追加ライブラリ */
//#include "spi_common.h"

#include <ESP32DMASPISlave.h>
ESP32DMASPI::Slave slave;
#include <PS4Controller.h> //PS4コントローラー
#include <ESP32Wiimote.h>  //Wiiコントローラー
ESP32Wiimote wiimote;

// (ES-2-2) PS4用を新規接続するためのペアリング情報解除設定
#include "esp_bt_main.h"
#include "esp_bt_device.h"
#include "esp_gap_bt_api.h"
#include "esp_err.h"

/* 頻繁に変更するであろう変数 #DEFINE */
#define FRAME_DURATION 10               // 1フレームあたりの単位時間（単位ms）
#define AP_SSID "xxxxxxxx"             // アクセスポイントのAP_SSID
#define AP_PASS "xxxxxxxx"              // アクセスポイントのパスワード
#define SEND_IP "192.168.1.x"          // 送り先のPCのIPアドレス（PCのIPアドレスを調べておく）
#define BT_MAC_ADDR "xx:xx:xx:xx:xx:xx" // ESP32自身のBluetoothMACアドレス（本プログラムを実行しシリアルモニタで確認）
// IPを固定する場合は下記の4項目を設定し、(ES-4-1) WiFi.configを有効にする 固定しない場合はコメントアウト必須
// IPAddress ip(192,168,xx,xx);//ESP32のIPアドレスを固定する場合のアドレス
// IPAddress subnet(255,255,255,0);//ESP32のIPアドレス固定する場合のサブネット
// IPAddress gateway(192,168,xx,xx);//ルーターのゲートウェイを入れる
// IPAddress DNS(8,8,8,8);//DNSサーバーの設定（使用せず）

#define JOYPAD_MOUNT 4    // ジョイパッドの搭載 (現在2のKRC-5FHのみ有効, ジョイパッドを接続しない場合は0)
                          // 0:なし、1:SBDBT(未), 2:KRC-5FH, 3:PS3(未), 4:PS4(未),5:Wii_yoko, 6:Wii+Nun(未), 7:WiiPRO(未), 8:Xbox(未)
#define JOYPAD_POLLING 10 // ジョイパッドの問い合わせフレーム間隔(PSは10)
bool UDP_SEND = true;     // PCへのデータ送信を行うか
bool UDP_RESEIVE = true;  // PCからのデータ受信を行うか

/* マスターコマンド定義 */

/* 各種設定 #DEFINE */
#define MSG_SIZE 90       // Meridim配列の長さ設定（デフォルトは90）
#define SEND_PORT 22222   // 送り先のポート番号
#define RESV_PORT 22224   // このESP32のポート番号
#define ERR_LED 25        // LED用 処理が時間内に収まっていない場合に点灯
#define BAUDRATE1 1250000 // サーボの通信速度
#define TIMEOUT1 2        // サーボ返信エラーをスルーするのに程よい設定が2
#define EN_PIN_L 33       // サーボL系統のENピン
#define EN_PIN_R 4        // サーボR系統のENピン
#define SERVO_NUM_L 11    // L系統につないだサーボの数
#define SERVO_NUM_R 11    // R系統につないだサーボの数
#define CHIPSELECT_SD 15  // SDカード用のCSピン

// (ES-1-4) 各種初期設定
//#define JOYPAD_POLLING 10 ////ジョイパッドの問い合わせフレーム間隔(ms)
#define MSG_SIZE 90                // Meridim配列の長さ設定（デフォルトは90）
#define SERIAL_PC 500000           // ESP-PC間のシリアル速度（モニタリング表示用）
const int MSG_BUFF = MSG_SIZE * 2; // Meridim配列のバイト長

// (ES-1-5) その他固定値
#define SEND_PORT 22222         //送り先のポート番号
#define RESV_PORT 22224         //このESP32のポート番号
#define REMOVE_BONDED_DEVICES 0 // 0でバインドデバイス情報表示、1でバインドデバイス情報クリア(BTリモコンがペアリング接続できない時に使用)
#define PAIR_MAX_DEVICES 20     //接続デバイスの記憶可能数
uint8_t pairedDeviceBtAddr[PAIR_MAX_DEVICES][6];
char bda_str[18];
// Meridim配列の長さ設定（デフォルトは90）

/* マルチスレッド用変数 */
TaskHandle_t thp[4]; //マルチスレッドのタスクハンドル格納用

/* リモコン用変数 */
unsigned short pad_btn = 0;
short pad_stick_R_x = 0;
short pad_stick_R_y = 0;
short pad_stick_L_x = 0;
short pad_stick_L_y = 0;
short pad_R2_val = 0;
short pad_L2_val = 0;
long pad_btn_disp = 65536;//ディスプレイ表示用（バイナリ表示の上位ビット）

// (ES-3-4) コントローラー用変数
//unsigned short pad_btn = 0;
short pad_stick_R = 0;
//short pad_stick_R_x = 0;
//short pad_stick_R_y = 0;
short pad_stick_L = 0;
//short pad_stick_L_x = 0;
//short pad_stick_L_y = 0;
short pad_stick_V = 0;
//short pad_R2_val = 0;
//short pad_L2_val = 0;
//long pad_btn_disp = 65536; 

/* センサー用変数 */

/* Meridim配列用の共用体の設定 */ //(ES-3-3) 共用体の設定. 共用体はたとえばデータをショートで格納し,バイト型として取り出せる
typedef union
{
  short sval[MSG_SIZE];
  uint8_t bval[MSG_BUFF];
} UnionData;
UnionData s_udp_meridim;  // UDP送信用共用体のインスタンスを宣言
UnionData r_udp_meridim;  // UDP受信用共用体のインスタンスを宣言
UnionData s_spi_meridim;  // SPI受信用共用体
UnionData r_spi_meridim;  // SPI受信用共用体
UnionData pad_bt_meridim; // リモコンのBT受信用共用体のインスタンスを宣言

/* DMA用の変数 */
uint8_t *s_spi_meridim_dma; // DMA用
uint8_t *r_spi_meridim_dma; // DMA用

/* 変数一般 */
long frame_count = 0;
long frame_ms = FRAME_DURATION;    // 1フレームあたりの単位時間(ms)
int frame_count_diff = 5;          // サインカーブ等で使う1フレームあたりの増分値
long merc = (long)millis();        // フレーム管理時計の時刻 Meridian Clock.
long curr_millis = (long)millis(); // 現在時刻を取得
long curr_micro = (long)micros();  // 現在時刻を取得
char frame_sync_s = 0;             // フレーム毎に0-199をカウントし、送信用Meridm[88]の下位8ビットに格納
char frame_sync_r_expect = 0;      // フレーム毎に0-199をカウントし、受信値と比較
char frame_sync_r_resv = 0;        // 今フレームに受信したframe_sync_rを格納
long error_count_udp = 0;          // UDP受信エラーカウント用
long error_count_spi = 0;          // SPI受信エラーカウント用
long error_count_esp_skip = 0;     // ESPのPCからの受信連番カウントエラー用

// float n;                    //計算用
int joypad_frame_count; //ジョイパッドのポーリングカウント

/* フラグ用変数 */          // (ES-3-2) フラグ関連
bool udp_revd_flag = false; // UDPスレッドでの受信完了フラグ
// bool udp_resv_process_queue_flag = false;  // UDP受信済みデータの処理待ちフラグ
// bool udp_send_flag = false;         // UDP送信完了フラグ
// bool spi_revd_flag = false;         // SPI受信完了フラグ
// bool udp_receiving_flag = false;    // UDPスレッドでの受信中フラグ（送信抑制）
bool udp_sending_flag = false; // UDPスレッドでの送信中フラグ（受信抑制）

//

// (ES-3-1) 変数一般
int checksum; //チェックサム計算用
//

/* wifi設定 */
WiFiUDP udp;

//================================================================================================================
//---- 関 数 各 種  -----------------------------------------------------------------------------------------------
//================================================================================================================

// +----------------------------------------------------------------------
// | 関数名　　:  float2HfShort(float val)
// +----------------------------------------------------------------------
// | 機能　　　:  floatを100倍し小数点以下を四捨五入した整数をshortに収める
// | 引数　　　:  float型. 有効数字　-327.67 ~ 327.67
// | 戻り値　　:  short型. 限界値を超えたら限界値を返す(-32767,32767)
// +----------------------------------------------------------------------
short float2HfShort(float val)
{
  int x = round(val * 100); // floatの小数点以下を四捨五入して整数化
  if (x > 32766)
  {
    x = 32767;
  }
  else if (x < -32766)
  {
    x = -32767;
  }
  return (short)x;
}

// +----------------------------------------------------------------------
// | 関数名　　:  float2HfInt(float val)
// +----------------------------------------------------------------------
// | 機能　　　:  floatを100倍し小数点以下を四捨五入した整数をintに収める
// | 引数　　　:  float型. 有効数字8桁(例:123.45678, -12345.678)
// | 戻り値　　:  int型.
// +----------------------------------------------------------------------
int float2HfInt(float val)
{
  int x = round(val * 100); // 100倍し小数点以下を四捨五入
  return x;
}

// +----------------------------------------------------------------------
// | 関数名　　:  Krs2HfDeg(int krs, int n, int pn)
// +----------------------------------------------------------------------
// | 機能     :  KRS単位値をdegree値*100に変換. HfはHundredfoldの略.
// | 引数１　　:  int型. サーボ値（KRS単位値）
// | 引数２　　:  int型. トリム値（KRS単位値）       具体例：idl_trim[i], idr_trim[i]
// | 引数３　　:  int型. 回転方向の順逆補正（+1,-1）　具体例：idl_cw[i],idr_cw[i]
// | 戻り値　　:  int型. degree値*100
// +----------------------------------------------------------------------
int Krs2HfDeg(int krs, int n, int pn)
{
  float x = (krs - 7500 - n) * 3.375 * pn;
  return int(x);
}

// +----------------------------------------------------------------------
// | 関数名　　:  HfDeg2Krs(int hfdegree, int n, int pn)
// +----------------------------------------------------------------------
// | 機能     :  degree値*100 をKRS単位値に変換. HfはHundredfoldの略.
// | 引数１　　:  float型. degree値
// | 引数２　　:  int型. トリム値（KRS単位値）       具体例：idl_trim[i], idr_trim[i]
// | 引数３　　:  int型. 回転方向の順逆補正（+1,-1）　具体例：idl_cw[i],idr_cw[i]
// | 戻り値　　:  int型. KRS単位値（3500-11500）
// | 備考　　　:  0.02度ぐらいからサーボ値には反映される(=0.59で1に繰り上がる)
// +----------------------------------------------------------------------
int HfDeg2Krs(int hfdegree, int n, int pn)
{
  float x = 7500 + n + (hfdegree / 3.375 * pn); //
  if (x > 11500)                                //上限を設定
  {
    x = 11500;
  }
  else if (x < 3500) //下限を設定
  {
    x = 3500;
  }
  return int(x);
}

// +----------------------------------------------------------------------
// | 関数名　　:  checksum_val(short arr[], int len)
// +----------------------------------------------------------------------
// | 機能     :  配列のチェックサムを算出
// | 　　     :  チェックサムは配列の末尾を除く合計数をビット反転しShort型にしたもの
// | 引数１　　:  Meridim配列(Short型の配列)
// | 引数２　　:  配列の長さ
// | 戻り値　　:  short型. チェックサム値
// +----------------------------------------------------------------------
short checksum_val(short arr[], int len)
{
  int cksm = 0;
  for (int i = 0; i < len - 1; i++)
  {
    cksm += int(arr[i]);
  }
  return short(~cksm);
}

// +-------------------------------------------------------------------
// | 関数名　　:  checksum_rslt(short arr[], int len)
// +-------------------------------------------------------------------
// | 機能     :  チェックサムの合否判定
// | 　　     :  配列の末尾を除く合計数をビット反転しShort型にしたものと、末尾の値を比較
// | 引数１　　:  Meridim配列(Short型の配列)
// | 引数２　　:  配列の長さ
// | 戻り値　　:  bool型. チェックサム値がOKならtrue, NGならfalse
// +------------------------------------------------------------------
bool checksum_rslt(short arr[], int len)
{
  int cksm = 0;
  for (int i = 0; i < len - 1; i++)
  {
    cksm += int(arr[i]);
  }
  if (short(~cksm) == arr[len - 1])
  {
    return true;
  }
  return false;
}

// +----------------------------------------------------------------------
// | 関数名　　:  receiveUDP()
// +----------------------------------------------------------------------
// | 機能     :  UDP通信の受信パケットを確認する。
// | 　　        受信完了を検出したら共用体 r_udp_meridim に値を格納し、
// | 　　        udp_revd_flag のフラグをtrueにする
// | 引数　　　:  なし
// +----------------------------------------------------------------------
void receiveUDP()
{
  if (udp.parsePacket() >= MSG_BUFF) //データの受信バッファ確認
  {
    udp.read(r_udp_meridim.bval, MSG_BUFF); //データの受信
    udp_revd_flag = true;                   //受信完了フラグを上げる
  }
  // delay(1);
}

//-------------------------------------------------------------------------
//---- U D P 受 信 用 ス レ ッ ド -------------------------------------------
//-------------------------------------------------------------------------
void Core0_UDP_r(void *args)
{ //サブCPU(Core0)で実行するプログラム
  delay(1000);
  while (1)
  {
    while (udp_sending_flag == false)
    {
      receiveUDP(); //常にUDPの受信を待ち受けし、受信が完了したらフラグを挙げる
      delay(1);     // 1/1000秒待つ
    }
    delay(1); // 1/1000秒待つ
  }
}

// +----------------------------------------------------------------------
// | 関数名　　:  sendUDP()
// +----------------------------------------------------------------------
// | 機能     :  共用体s_udp_meridimをUDP通信で送信する
// | 引数　　　:  なし
// +----------------------------------------------------------------------
void sendUDP()
{
  udp.beginPacket(SEND_IP, SEND_PORT); // UDPパケットの開始
  udp.write(s_udp_meridim.bval, MSG_BUFF);
  udp.endPacket(); // UDPパケットの終了
}

// +----------------------------------------------------------------------
// | 関数名　　:  initBluetooth()
// +----------------------------------------------------------------------
// | 機能     :  Bluetoothペアリングを設定する
// | 引数　　　:  なし
// +----------------------------------------------------------------------
bool initBluetooth()
{
  if (!btStart())
  {
    Serial.println("Failed to initialize controller");
    return false;
  }

