Ninagawa123/Meridian_Dev/PlatformIO/TypeK_ESP32_0614/main.cpp
  if (esp_bluedroid_init() != ESP_OK)
  {
    Serial.println("Failed to initialize bluedroid");
    return false;
  }

  if (esp_bluedroid_enable() != ESP_OK)
  {
    Serial.println("Failed to enable bluedroid");
    return false;
  }
  return true;
}

// +----------------------------------------------------------------------
// | 関数名　　:  *bda2str(const uint8_t* bda, char *str, size_t size)
// +----------------------------------------------------------------------
// | 機能     :  Bluetoothペアリングアドレスを取得する
// | 引数　　　:  なし
// +----------------------------------------------------------------------
char *bda2str(const uint8_t *bda, char *str, size_t size)
{
  if (bda == NULL || str == NULL || size < 18)
  {
    return NULL;
  }
  sprintf(str, "%02x:%02x:%02x:%02x:%02x:%02x",
          bda[0], bda[1], bda[2], bda[3], bda[4], bda[5]);
  return str;
}


// +----------------------------------------------------------------------
// | 関数名　　:  PS4pad_receive()
// +----------------------------------------------------------------------
// | 機能     :  PS4リモコンの入力値を受信し、以下に値を格納する
// | 　　        pad_btn, pad_L2_val, pad_R2_val, pad_stick_L , pad_stick_R, pad_stick_V
// | 引数　　　:  なし
// +----------------------------------------------------------------------


void PS4pad_receive()
{
  // Below has all accessible outputs from the controller
  if (PS4.isConnected())
  {
    pad_btn = 0;

    if (PS4.Right())
      pad_btn |= (B00000000 * 256) + B00100000;
    if (PS4.Down())
      pad_btn |= (B00000000 * 256) + B01000000;
    if (PS4.Up())
      pad_btn |= (B00000000 * 256) + B00010000;
    if (PS4.Left())
      pad_btn |= (B00000000 * 256) + B10000000;

    if (PS4.Square())
      pad_btn |= (B10000000 * 256) + B00000000;
    if (PS4.Cross())
      pad_btn |= (B01000000 * 256) + B00000000;
    if (PS4.Circle())
      pad_btn |= (B00100000 * 256) + B00000000;
    if (PS4.Triangle())
      pad_btn |= (B00010000 * 256) + B00000000;

    if (PS4.UpRight())
      pad_btn |= (B00000000 * 256) + B00110000;
    if (PS4.DownRight())
      pad_btn |= (B00000000 * 256) + B01100000;
    if (PS4.UpLeft())
      pad_btn |= (B00000000 * 256) + B10010000;
    if (PS4.DownLeft())
      pad_btn |= (B00000000 * 256) + B11000000;

    if (PS4.L1())
      pad_btn |= (B00000100 * 256) + B00000000;
    if (PS4.R1())
      pad_btn |= (B00001000 * 256) + B00000000;

    if (PS4.Share())
      pad_btn |= (B00000000 * 256) + B00000001;
    if (PS4.Options())
      pad_btn |= (B00000000 * 256) + B00001000;
    if (PS4.L3())
      pad_btn |= (B00000000 * 256) + B00000100;
    if (PS4.R3())
      pad_btn |= (B00000000 * 256) + B00000010;

    if (PS4.PSButton())
      pad_btn |= (B00000000 * 256) + B01010000; // same as up & down
    if (PS4.Touchpad())
      pad_btn |= (B00000000 * 256) + B00101000; // same as left & right

    if (PS4.L2())
    {
      pad_btn |= (0x00000001 * 256) + B00000000;
      pad_L2_val = constrain(PS4.L2Value(), 0, 255);
    }
    if (PS4.R2())
    {
      pad_btn |= 512; //(0x00000010 * 256) + B00000000;
      pad_R2_val = constrain(PS4.R2Value(), 0, 255);
    }

    if (PS4.LStickX())
    {
      pad_stick_L_x = constrain(PS4.LStickX(), -127, 127);
    }
    if (PS4.LStickY())
    {
      pad_stick_L_y = constrain(PS4.LStickY(), -127, 127);
    }
    if (PS4.RStickX())
    {
      pad_stick_R_x = constrain(PS4.RStickX(), -127, 127);
    }
    if (PS4.RStickY())
    {
      pad_stick_R_y = constrain(PS4.RStickY(), -127, 127);
    }

    pad_stick_L = pad_stick_L_x * 256 + pad_stick_L_y;
    pad_stick_R = pad_stick_R_x * 256 + pad_stick_R_y;
    pad_stick_V = pad_L2_val * 256 + pad_R2_val;
  }
}

// +----------------------------------------------------------------------
// | 関数名　　:  Wiipad_receive()
// +----------------------------------------------------------------------
// | 機能     :  Wiiリモコン(横持ち・横持ち+ヌンチャク)の入力値を受信し、以下に値を格納する
// | 　　        pad_btn, pad_stick_L
// | 引数　　　:  なし
// +----------------------------------------------------------------------


void Wiipad_receive()
{
  wiimote.task();
  if (wiimote.available() > 0)
  {
    uint16_t button = wiimote.getButtonState();
    NunchukState nunchuk = wiimote.getNunchukState();
    pad_btn = 0;

    if (button & 0x0400)
      pad_btn |= (B00000000 * 256) + B00100000; // right
    if (button & 0x0100)
      pad_btn |= (B00000000 * 256) + B01000000; // down
    if (button & 0x0200)
      pad_btn |= (B00000000 * 256) + B00010000; // up
    if (button & 0x0800)
      pad_btn |= (B00000000 * 256) + B10000000; // left

    if (button & 0x0008)
      pad_btn |= (B10000000 * 256) + B00000000; // A
    if (button & 0x0002)
      pad_btn |= (B01000000 * 256) + B00000000; // 1
    if (button & 0x0001)
      pad_btn |= (B00100000 * 256) + B00000000; // 2
    if (button & 0x0004)
      pad_btn |= (B00010000 * 256) + B00000000; // B

    if (button & 0x0010)
      pad_btn |= (B00000000 * 256) + B00000001; //+
    if (button & 0x1000)
      pad_btn |= (B00000000 * 256) + B00001000; //-

    if (button & 0x0080)
      pad_btn |= (B00000000 * 256) + B01010000; // same as up & down//home

    if (JOYPAD_MOUNT == 2)
    {
      NunchukState nunchuk = wiimote.getNunchukState();
      int calib_l1x = 5;  // LスティックX軸のセンターのキャリブレーション値
      int calib_l1y = -6; // LスティックY軸のセンターのキャリブレーション値
      pad_stick_L = ((nunchuk.xStick + calib_l1x - 127) * 256 + (nunchuk.yStick - 127 + calib_l1y));
      // if (nunchuk.cBtn == 1) pad_btn |= (B00000100 * 256) + B00000000;
      // if (nunchuk.zBtn == 1) pad_btn |= (0x00000001 * 256) + B00000000;
    }
    Serial.print(127 - nunchuk.xStick);
    Serial.print(",");
    Serial.println(nunchuk.yStick - 127);

    delay(1); //ここの数値でCPU負荷を軽減できるかも
  }
}


//-------------------------------------------------------------------------
//---- Bluetooth 用 ス レ ッ ド --------------------------------------------
//-------------------------------------------------------------------------
void Core0_BT_r(void *args)
{ //サブCPU(Core0)で実行するプログラム
  while (1)
  { //ここで無限ループを作っておく
    // PS4コントローラの受信
    if (JOYPAD_MOUNT == 4)
    {
      PS4pad_receive();
    }

    // Wiiコントローラの受信
    if ((JOYPAD_MOUNT == 1) or (JOYPAD_MOUNT == 2))
    {
      Wiipad_receive();
    }

    delay(1); // JOYPAD_POLLING ms秒待つ
  }
}


//================================================================================================================
//---- S E T  U P -----------------------------------------------------------------------------------------------
//================================================================================================================
void setup()
{
  /* ピンモードの設定 */
  pinMode(ERR_LED, OUTPUT); // エラー用LED

