Ninagawa123/Meridian_Dev/PlatformIO/TypeK_ESP32_0614/main.cpp
  /* PC用シリアルの設定 */ // (ES-4-2) シリアル設定
  Serial.begin(SERIAL_PC);
  delay(130); //シリアルの開始を待ち安定化させるためのディレイ（ほどよい）
  Serial.println();
  Serial.println("Serial Start...");
  Serial.println();
  Serial.println(VERSION);
  Wire.begin(22, 21);

  /* WiFiの初期化と開始 */     //(ES-4-1) WiFi 初期化
  WiFi.disconnect(true, true); // WiFi接続をリセット
  // WiFi.config(ip, gateway, subnet, DNS);//※IPを固定にする場合はコメントアウトをはずして有効にする(ES-1-1)も変更すること

  // Serial.println("Connecting to WiFi to : " + String(AP_SSID)); //接続先を表示
  delay(100);
  WiFi.begin(AP_SSID, AP_PASS); // Wifiに接続
  while (WiFi.status() != WL_CONNECTED)
  {            // https://www.arduino.cc/en/Reference/WiFiStatus 返り値一覧
    delay(50); //接続が完了するまでループで待つ
  }
  Serial.println("WiFi connected to  => " + String(AP_SSID)); // WiFi接続完了通知

  Serial.print("PC's IP address is  => ");
  Serial.println(SEND_IP); // 送信先PCのIPアドレスの表示

  Serial.print("ESP32's IP address is  => ");
  Serial.println(WiFi.localIP()); // ESP32自身のIPアドレスの表示
  udp.begin(RESV_PORT);           // UDP通信の開始

  /* Bluetoothの初期化 */
  initBluetooth();
  Serial.print("ESP32's Bluetooth Mac Address is => "); // ESP32自身のBluetoothMacアドレスを表示
  Serial.println(bda2str(esp_bt_dev_get_address(), bda_str, 18));

  /* Bluetoothの初期化 */
  // uint8_t bt_mac[6];
  // String self_mac_address = "";
  // esp_read_mac(bt_mac, ESP_MAC_BT); // ESP32自身のBluetoothMacアドレスを表示
  // self_mac_address = String(bt_mac[0], HEX) + ":" + String(bt_mac[1], HEX) + ":" + String(bt_mac[2], HEX) + ":" + String(bt_mac[3], HEX) + ":" + String(bt_mac[4], HEX) + ":" + String(bt_mac[5], HEX);
  // Serial.print("ESP32's Bluetooth Mac Address is => " + self_mac_address);
  Serial.println();
  delay(1000);

  // (ES-4-4) BTペアリング情報
  int bt_count = esp_bt_gap_get_bond_device_num();
  if (!bt_count)
  {
    Serial.println("No bonded BT device found.");
  }
  else
  {
    Serial.print("Bonded BT device count: ");
    Serial.println(bt_count);
    if (PAIR_MAX_DEVICES < bt_count)
    {
      bt_count = PAIR_MAX_DEVICES;
      Serial.print("Reset bonded device count: ");
      Serial.println(bt_count);
    }
    esp_err_t tError = esp_bt_gap_get_bond_device_list(&bt_count, pairedDeviceBtAddr);
    if (ESP_OK == tError)
    {
      for (int i = 0; i < bt_count; i++)
      {
        Serial.print("Found bonded BT device # ");
        Serial.print(i);
        Serial.print(" -> ");
        Serial.println(bda2str(pairedDeviceBtAddr[i], bda_str, 18));
        if (REMOVE_BONDED_DEVICES)
        {
          esp_err_t tError = esp_bt_gap_remove_bond_device(pairedDeviceBtAddr[i]);
          if (ESP_OK == tError)
          {
            Serial.print("Removed bonded BT device # ");
          }
          else
          {
            Serial.print("Failed to remove bonded BT device # ");
          }
          Serial.println(i);
        }
      }
    }
  }

  // (ES-4-5-1) PS4コントローラの接続開始
  /*
  if (JOYPAD_MOUNT == 4)
  {
    PS4.begin(BT_MAC_ADDR); // ESP32のMACが入ります.PS4にも設定します。
    Serial.println("PS4 controller connecting...");
  }
  */

  // (ES-4-5-2) Wiiコントローラの接続開始
  /*
  if ((JOYPAD_MOUNT == 5) or (JOYPAD_MOUNT == 6))
  {
    wiimote.init();
    // wiimote.addFilter(ACTION_IGNORE, FILTER_NUNCHUK_ACCEL);
    Serial.println("Wiimote connecting...");
  }
  */

  // (ES-4-7) DMAバッファを使う設定　これを使うと一度に送受信できるデータ量を増やせる
  s_spi_meridim_dma = slave.allocDMABuffer(MSG_BUFF + 4); // DMAバッファ設定
  r_spi_meridim_dma = slave.allocDMABuffer(MSG_BUFF + 4); // DMAバッファ設定
  //※バッファサイズは4で割り切れる必要があり、なおかつ末尾に4バイト分0が入る不具合があるのでその対策

  // (ES-4-8) 送受信バッファをリセット
  memset(s_spi_meridim_dma, 0, MSG_BUFF + 4); // ※+4は不具合対策
  memset(r_spi_meridim_dma, 0, MSG_BUFF + 4);

  // (ES-4-9) 初回の送信データを作成してセット
  checksum = 0;
  for (int i = 0; i < MSG_SIZE - 1; i++) //配列の末尾以外にデータを入れる
  {
    s_spi_meridim.sval[i] = 0;              //配列にランダムなデータを入れる
    checksum += int(s_spi_meridim.sval[i]); //チェックサムを加算
  }
  checksum = short(~checksum);                        //チェックサムを計算
  s_spi_meridim.sval[MSG_SIZE - 1] = short(checksum); //データ末尾にチェックサムを入れる
  for (int i = 0; i < MSG_BUFF; i++)
  { //送信データをDMAバッファに転記
    s_spi_meridim_dma[i] = s_spi_meridim.bval[i];
  }


  /* スレッドの開始 */
  // (ES-4-10) マルチスレッドの宣言（無線系はすべてCORE0で動く.メインループはCORE1）
  xTaskCreatePinnedToCore(Core0_UDP_r, "Core0_UDP_r", 4096, NULL, 20, &thp[1], 0);
  xTaskCreatePinnedToCore(Core0_BT_r, "Core0_BT_r", 4096, NULL, 5, &thp[2], 0);

  // (ES-4-11) SPI通信の設定
  slave.setDataMode(SPI_MODE3);
  slave.setMaxTransferSize(MSG_BUFF + 4);
  slave.setDMAChannel(2); // 専用メモリの割り当て(1か2のみ)
  slave.setQueueSize(1);  // キューサイズ　とりあえず1
  slave.begin();          // 引数を指定しなければデフォルトのSPI（SPI2,HSPIを利用）ピン番号は CS: 15, CLK: 14, MOSI: 13, MISO: 12
}

//================================================================================================================
//---- M A I N  L O O P -----------------------------------------------------------------------------------------
//================================================================================================================
void loop()
{

  //////// < 1 > U D P 受 信 ///////////////////////////////////////////////////////

  // @ [1-1a] UDP受信の実行
  //  --->> [check!] UDP受信は別スレッド void Core0_UDP_r() で実行されている.
  // @ [1-1b] UDP受信完了待ちループ
  while (udp_revd_flag != true)
  {
    delayMicroseconds(100);
    Serial.println("Waiting_udp...");
  }
  Serial.println("Rsvd_udp.");
  udp_revd_flag = false; // UDP受信完了フラグを下げる.

  // @ [1-2] UDP受信配列からSPI送信配列にデータを転写.
  // @ [1-2-1] UDP受信データ r_udp_meridim のチェックサムを確認.

  if (checksum_rslt(r_udp_meridim.sval, MSG_SIZE)) 
  // @ [1-2-1-a-1] UDP受信チェックサムOKの場合
  {
    // UDP受信データをSPI送信データに上書き更新する.
    memcpy(s_spi_meridim.bval, r_udp_meridim.bval, MSG_BUFF + 4);
    delayMicroseconds(1);

    // UDP受信エラーフラグを下げる
    s_spi_meridim.bval[177] &= 0B10111111; // meridimの[88]番の14ビット目(ESPのUPD受信成否)のフラグを下げる.

  }
  //[1-2-1-b] UDP受信チェックサムNGの場合
  else 
  {
    // UDP受信データをSPI送信データに上書き更新せず, 前回のSPI送信データにエラーフラグだけ上乗せする.
    s_spi_meridim.bval[177] |= B01000000; // meridimの[88]番の14ビット目(ESPのUPD受信成否)のフラグを上げる.
    error_count_udp++;                    //エラーカウンタをアップ.
  }

