Ninagawa123/Meridian_Dev/PlatformIO/TypeK_ESP32_0614/main.cpp
  //////// < 2 > S P I 送 信 信 号 作 成 /////////////////////////////////////////////

  // @ [2-1] ユーザー定義の送信データの書き込み
  // Teensyへ送るデータをこのパートで作成, 書き込み.
  //  --->> [check!] 現在はここでとくに何もしない.

  // @ [2-2] コントロールパッド受信値の転記
  if (JOYPAD_MOUNT == 4)
  {
    //for (int i = 80; i < 84; i++)
    //{
    //  s_udp_meridim.sval[i] = pad_bt_meridim.sval[i];
    //}
  s_spi_meridim.sval[80] = pad_btn;
  s_spi_meridim.sval[81] = pad_stick_L;
  s_spi_meridim.sval[82] = pad_stick_R;
  s_spi_meridim.sval[83] = pad_stick_V;
  }

  //  --->> [check!] ここでSPI送信データ s_spi_meridim はESP32で受けたリモコンデータが上書きされた状態.


  //[2-4] チェックサムの追記
  s_spi_meridim.sval[MSG_SIZE - 1] = checksum_val(s_spi_meridim.sval, MSG_SIZE);
  //  --->> [check!] ここでSPI送信データ s_spi_meridim はチェックサムが入り完成している状態.

  //////// < 3 > S P I 送 受 信 /////////////////////////////////////////////////////

  while (slave.available()) //完了した（受信した）トランザクション結果のサイズ
  {
    //[3-1] 完成したSPI送信データをDMAに転記
    memcpy(s_spi_meridim_dma, s_spi_meridim.bval, MSG_BUFF + 4);
    delayMicroseconds(1);
    slave.pop(); // DMAのデータ配列の中で最新の要素を削除
  }

  //[3-2] SPI送受信の実行
  // SPIの送受信:キューが送信済みであればセットされた送信データを送信する.
  // ★★★★★★ ここは 上の処理が終わったことを確認して次に進むようにしたい。
  // 空っぽのファイルを送ったりするのは無駄かも。
  // 一方で、タイムアウトの概念はあってもよいのかも？

  if (slave.remained() == 0)//★★★★★★ ここの処理はなくても動くかも
  { //キューに入れられた（完了していない）トランザクションのサイズが0なら実行.
    slave.queue(r_spi_meridim_dma, s_spi_meridim_dma, MSG_BUFF + 4);
    frame_count = frame_count + 1; // SPIの受信をもってフレームカウントとする

    //////// < 1 > U D P 送 信 信 号 作 成 ////////////////////////////////////////////
    //[4-1] 受信したSPI送信データをUDP送信データに転記.
    memcpy(s_udp_meridim.bval, r_spi_meridim_dma, MSG_BUFF);//+4は不要
    
    delayMicroseconds(1);
    //  --->> [check!] UDP送信データ"s_udp_meridim"に中身が入った状態.

    //////// < 2 > U D P 送 信 ///////////////////////////////////////////////////////
    // @ [2-1] UDP送信を実行
    udp_sending_flag = true;
    if (UDP_SEND) //設定でUDPの送信を行うかどうか決定
    {
      sendUDP();
    }
    delayMicroseconds(5);
    udp_sending_flag = false;
  }
}
